
Функция ПолучитьКурс(Валюта, Дата) Экспорт
	
	Если Валюта <> Справочники.Валюты.Рубль Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&Дата,
		|			Валюта = &Валюта
		|				И Курс <> 0) КАК КурсыВалютСрезПоследних";
		
		Запрос.УстановитьПараметр("Валюта", Валюта);
		Запрос.УстановитьПараметр("Дата", Дата);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Курс;
		Иначе
			Возврат Ложь; 
		КонецЕсли; 
	ИначеЕсли Валюта = Справочники.Валюты.Рубль Тогда 
		Возврат 1;
	КонецЕсли;
	
КонецФункции

Функция ЦенаНоменклатурыНаСервере(Номенклатура, ВидЦены, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМетодСписанияСебестоимости(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МетодыСписанияСебестоимостиСрезПоследних.Значение КАК Метод
	|ИЗ
	|	РегистрСведений.МетодыСписанияСебестоимости.СрезПоследних(&Дата, ) КАК МетодыСписанияСебестоимостиСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Метод;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДолжностьНаСервере(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Владелец КАК Должность
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Должность;	
	Иначе
		Возврат Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ЕстьДокументВведенныйНаОсновании(Ссылка, ОснованиеДокумента, НовыйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НовыйДокумент.Ссылка КАК Документ
	|ИЗ
	|	Документ.НовыйДокумент КАК НовыйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОснованиеДокумента КАК ОснованиеДокумента
	|		ПО НовыйДокумент.Основание = ОснованиеДокумента.Ссылка
	|ГДЕ
	|	ОснованиеДокумента.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НовыйДокумент", НовыйДокумент);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ОснованиеДокумента", ОснованиеДокумента);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Документ;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции //ПолучитьСсылкуНаДокумент





