
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВидДокумента = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите csv файл'")
	+ "(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументНаСервере(ДанныеФормы)
	
	Если Строка(Объект.ВидДокумента) = "1" Тогда
		НовыйДокумент = Документы.ПоступлениеТоваров.СоздатьДокумент();
		НовыйДокумент.Поставщик = Объект.Контрагент;	
	Иначе
		НовыйДокумент = Документы.РеализацияТоваров.СоздатьДокумент();
		НовыйДокумент.Покупатель = Объект.Контрагент;
	КонецЕсли;
	НовыйДокумент.Дата = ТекущаяДата();
	ДанныеЗаполнения = ПолучитьДанныеЗаполнения(Объект.ПутьКФайлу);
	Сумма = 0;
	Для каждого СтрокаДанных Из ДанныеЗаполнения Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		Если НЕ Справочники.Номенклатура.НайтиПоНаименованию(СтрокаДанных.Номенклатура, Истина).Пустая()  Тогда
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаДанных.Номенклатура, Истина);
		Иначе
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			НовыйЭлемент.Наименование = СтрокаДанных.Номенклатура;
			НовыйЭлемент.Записать();
			НоваяСтрока.Номенклатура = НовыйЭлемент.Ссылка;
			Сообщить("Создан элемент Номенклатуры: " + НовыйЭлемент);
		КонецЕсли;
		Сумма = Сумма + СтрокаДанных.Стоимость;
	КонецЦикла;
	НовыйДокумент.СуммаПоДокументу = Сумма;
	ЗначениеВДанныеФормы(НовыйДокумент,ДанныеФормы);
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	Если Объект.ПутьКФайлу = "" Тогда
		Сообщить("Не выбран файл!");
		Возврат;	
	КонецЕсли;
	Если Объект.Контрагент.Пустая() Тогда
		Сообщить("Не выбран контрагент!");
		Возврат;
	КонецЕсли;
	Если Строка(Объект.ВидДокумента) = "1" Тогда
		Форма = ПолучитьФорму("Документ.ПоступлениеТоваров.ФормаОбъекта");
	ИначеЕсли Строка(Объект.ВидДокумента) = "2" Тогда
		Форма = ПолучитьФорму("Документ.РеализацияТоваров.ФормаОбъекта");
	Иначе 
		Сообщить("Не выбран вид документа!");
		Возврат;
	КонецЕсли;
	ДанныеФормы = Форма.Объект; 
	СоздатьДокументНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаполнения(ПутьКФайлу)
	
	ДанныеЗаполнения = Новый ТаблицаЗначений;
	ДанныеЗаполнения.Колонки.Добавить("Номенклатура");
	ДанныеЗаполнения.Колонки.Добавить("Количество");
	ДанныеЗаполнения.Колонки.Добавить("Цена");
	ДанныеЗаполнения.Колонки.Добавить("Стоимость");
	
	Документ = Новый ТекстовыйДокумент; 
	Документ.Прочитать(ПутьКФайлу);
	Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		СтрокаДокумента               = Документ.ПолучитьСтроку(НомерСтроки);
		МассивЗначенийСтроки          = СтрРазделить(СтрокаДокумента,";");
		Строка 						  = ДанныеЗаполнения.Добавить();
		Строка.Номенклатура           = МассивЗначенийСтроки[0];
		Строка.Количество             = МассивЗначенийСтроки[1];
		Строка.Цена   				  = МассивЗначенийСтроки[2];
		Строка.Стоимость              = МассивЗначенийСтроки[3];
		
	КонецЦикла;
	Возврат ДанныеЗаполнения;	
	
КонецФункции 



