
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	ЗаголовокОтчета = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Заголовок");
//	ПериодОтчета  = ПолучитьПараметр("ПериодОтчета", КомпоновщикНастроек).Значение;
//	НачалоПериода = ПериодОтчета.ДатаНачала;
//	КонецПериода  = ПериодОтчета.ДатаОкончания;
//	ПараметрыВывода = КомпоновщикНастроек.Настройки.ПараметрыВывода;
//	ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", "Остатки товаров по складам за период с " + НачалоПериода + " по " + КонецПериода);
//	ЗаголовокОтчета.Использование = Истина;
//КонецПроцедуры
