
Функция СформироватьПредставлениеДокумента(Документ) Экспорт
	
	Возврат Строка(ТипЗнч(Документ)) + " №" + Строка(Число(Документ.Номер)) + " от " + Строка(Формат(Документ.Дата,"ДФ=dd.MM.yyyy")); 
	
КонецФункции

Процедура ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ РольДоступна("Администратор") Тогда
		Если ТипЗнч(Источник) <> Тип("СправочникОбъект.Номенклатура") Тогда
			Если НЕ РольДоступна("Бухгалтер") Тогда
				Если НЕ Источник.Автор.Пустая() И НЕ Источник.Автор = ПараметрыСеанса.ТекущийПользователь Тогда
					Сообщить("Объект создал " + Источник.Автор + ", а текущий пользователь " + ПараметрыСеанса.ТекущийПользователь 
					+ " для изменений объекта обратитесь к " + Источник.Автор);
					Отказ = Истина;
				ИначеЕсли Источник.Автор.Пустая() ИЛИ РольДоступна("Бухгалтер") Тогда 
					Источник.Автор = ПараметрыСеанса.ТекущийПользователь; 
				КонецЕсли;
			Иначе
				Если НЕ Источник.Автор.Пустая() И Источник.Автор <> ПараметрыСеанса.ТекущийПользователь Тогда
					Попытка
						Источник.Комментарий = "Изменения внес: " + ПараметрыСеанса.ТекущийПользователь + " " + ТекущаяДата();
					Исключение
						//Не у всех объектов есть реквизит "Комментарий", ошибка не обрабатывается.
					КонецПопытки;
				Иначе
					Источник.Автор = ПараметрыСеанса.ТекущийПользователь;	
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
