Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеЗаголовка = КомпоновщикНастроек.Настройки.ПараметрыВывода.
    НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
        
    МесяцНачислений = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(0).Значение.ДатаНачала;  
    МесяцНачислений = Формат(Дата(МесяцНачислений),  "ДФ=ММММ гггг");
    
    ЗначениеЗаголовка.Значение="Начисления сотрудникам за  " + Формат(Дата(МесяцНачислений),  "ДФ='MMMM yyyy ''г.'''");
    ЗначениеЗаголовка.Использование = Истина; 

КонецПроцедуры