&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Элементы.Валюта.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Валюта.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.Валюта.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.Валюта.Доступность = Истина;
	
КонецПроцедуры
